<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ul.lst-kix_785ou7u3h5el-8{list-style-type:none}ul.lst-kix_785ou7u3h5el-7{list-style-type:none}ul.lst-kix_785ou7u3h5el-6{list-style-type:none}ul.lst-kix_785ou7u3h5el-5{list-style-type:none}ul.lst-kix_785ou7u3h5el-4{list-style-type:none}ul.lst-kix_785ou7u3h5el-3{list-style-type:none}ul.lst-kix_785ou7u3h5el-2{list-style-type:none}ul.lst-kix_785ou7u3h5el-1{list-style-type:none}ul.lst-kix_785ou7u3h5el-0{list-style-type:none}.lst-kix_785ou7u3h5el-0>li:before{content:"-  "}.lst-kix_qz6u7oblu8xc-3>li:before{content:"-  "}.lst-kix_qz6u7oblu8xc-4>li:before{content:"-  "}.lst-kix_785ou7u3h5el-1>li:before{content:"-  "}ul.lst-kix_qz6u7oblu8xc-0{list-style-type:none}.lst-kix_785ou7u3h5el-2>li:before{content:"-  "}ul.lst-kix_qz6u7oblu8xc-2{list-style-type:none}.lst-kix_qz6u7oblu8xc-0>li:before{content:"-  "}ul.lst-kix_qz6u7oblu8xc-1{list-style-type:none}.lst-kix_qz6u7oblu8xc-8>li:before{content:"-  "}ul.lst-kix_qz6u7oblu8xc-4{list-style-type:none}ul.lst-kix_qz6u7oblu8xc-3{list-style-type:none}.lst-kix_785ou7u3h5el-4>li:before{content:"-  "}ul.lst-kix_qz6u7oblu8xc-6{list-style-type:none}.lst-kix_qz6u7oblu8xc-1>li:before{content:"-  "}.lst-kix_qz6u7oblu8xc-2>li:before{content:"-  "}ul.lst-kix_qz6u7oblu8xc-5{list-style-type:none}.lst-kix_785ou7u3h5el-3>li:before{content:"-  "}ul.lst-kix_qz6u7oblu8xc-8{list-style-type:none}ul.lst-kix_qz6u7oblu8xc-7{list-style-type:none}.lst-kix_785ou7u3h5el-6>li:before{content:"-  "}.lst-kix_785ou7u3h5el-5>li:before{content:"-  "}.lst-kix_qz6u7oblu8xc-7>li:before{content:"-  "}.lst-kix_785ou7u3h5el-8>li:before{content:"-  "}.lst-kix_qz6u7oblu8xc-5>li:before{content:"-  "}.lst-kix_qz6u7oblu8xc-6>li:before{content:"-  "}.lst-kix_785ou7u3h5el-7>li:before{content:"-  "}ol{margin:0;padding:0}table td,table th{padding:0}.c1{margin-left:36pt;padding-top:0pt;padding-left:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c4{margin-left:36pt;padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c2{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left;height:11pt}.c0{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c5{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c3{text-decoration-skip-ink:none;-webkit-text-decoration-skip:none;color:#1155cc;text-decoration:underline}.c9{background-color:#ffffff;max-width:451.4pt;padding:72pt 72pt 72pt 72pt}.c8{background-color:#f8f8f8;font-size:11.5pt;color:#1d1c1d}.c6{padding:0;margin:0}.c7{color:inherit;text-decoration:inherit}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c9"><p class="c5"><span class="c0">&#1058;&#1077;&#1089;&#1090;&#1086;&#1074;&#1086;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; Go-developer:</span></p><p class="c2"><span class="c0"></span></p><p class="c5"><span class="c0">&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; api &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; MongoDb.</span></p><p class="c5"><span class="c0"><br>&#1058;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;:</span></p><p class="c5"><span class="c0"><br>&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084;&#1080;:</span></p><ul class="c6 lst-kix_785ou7u3h5el-0 start"><li class="c1"><span class="c0">&#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; users &#1080; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1077;&#1105; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;&#1099;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; (&#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1080;&#1078;&#1077;)</span></li><li class="c1"><span class="c0">&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1086;&#1074;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1089; &#1074;&#1072;&#1083;&#1080;&#1076;&#1072;&#1094;&#1080;&#1077;&#1081; &#1087;&#1086;&#1083;&#1077;&#1081; &#1085;&#1072; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1091; (email, &#1076;&#1072;&#1090;&#1072; &#1080; &#1090;.&#1076;.)</span></li><li class="c1"><span class="c0">&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1089; &#1087;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1095;&#1085;&#1086;&#1081; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1077;&#1081; (&#1089; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;&#1084;&#1080; &#1087;&#1086; &#1087;&#1086;&#1083;&#1103;&#1084;)</span></li></ul><p class="c5"><span class="c0">&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1080;&#1075;&#1088;&#1072;&#1084;&#1080;:</span></p><ul class="c6 lst-kix_qz6u7oblu8xc-0 start"><li class="c1"><span class="c0">&#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; user_games &#1080; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1077;&#1105; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;&#1099;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; (&#1090;&#1077;&#1093; &#1095;&#1090;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1083;&#1080; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; users &#1089; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072;), &#1085;&#1072;&#1073;&#1086;&#1088; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086; &#1080;&#1075;&#1088;&#1072;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; &#1087;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1077; &#1085;&#1080;&#1078;&#1077; &#1085;&#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1085;&#1076;&#1086;&#1084;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1080;&#1075;&#1088; &#1089; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (&#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084; 5000 &#1079;&#1072;&#1087;&#1080;&#1089;&#1077;&#1081; &#1085;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;).</span></li><li class="c1"><span class="c0">&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1080;&#1075;&#1088; &#1089; &#1087;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1095;&#1085;&#1086;&#1081; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1077;&#1081; (&#1089; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;&#1084;&#1080; &#1087;&#1086; &#1087;&#1086;&#1083;&#1103;&#1084;)</span></li><li class="c1"><span class="c0">&#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1087;&#1086; &#1080;&#1075;&#1088;&#1072;&#1084; (&#1089; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;&#1084;&#1080; &#1087;&#1086; &#1076;&#1072;&#1090;&#1077;):</span></li></ul><p class="c4"><span class="c0">- &#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1082;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072; &#1087;&#1086; &#1076;&#1085;&#1103;&#1084; (&#1089;&#1091;&#1084;&#1084;&#1072; &#1080;&#1075;&#1088; &#1079;&#1072; &#1074; &#1076;&#1077;&#1085;&#1100;)</span></p><p class="c4"><span class="c0">- &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1082;&#1091; &#1089;&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1087;&#1086; &#1085;&#1086;&#1084;&#1077;&#1088;&#1072;&#1084; &#1080;&#1075;&#1088; &#1080; &#1076;&#1085;&#1103;&#1084;</span></p><p class="c5"><span class="c0">&nbsp; &nbsp; &nbsp; - &nbsp; &nbsp;&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1088;&#1077;&#1081;&#1090;&#1080;&#1085;&#1075;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; (&#1088;&#1077;&#1081;&#1090;&#1080;&#1085;&#1075; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1091; &#1089;&#1099;&#1075;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1080;&#1075;&#1088;), api &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1086;&#1090;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1087;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1095;&#1085;&#1086;&#1081; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1077;&#1081;. &#1042; &#1086;&#1090;&#1074;&#1077;&#1090;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074; &#1088;&#1077;&#1081;&#1090;&#1080;&#1085;&#1075;&#1077; &#1085;&#1086; &#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086; &#1085;&#1077;&#1084; (&#1080;&#1084;&#1103;, &#1092;&#1072;&#1084;&#1080;&#1083;&#1080;&#1103;, &#1076;&#1072;&#1090;&#1072; &#1088;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;)</span></p><p class="c2"><span class="c0"></span></p><p class="c5"><span class="c8">&#1057;&#1084;&#1099;&#1089;&#1083; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1085;&#1072;&#1074;&#1099;&#1082;&#1080; &#1082;&#1072;&#1085;&#1076;&#1080;&#1076;&#1072;&#1090;&#1072; &#1087;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089;&#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1086;&#1087;&#1090;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1086;&#1087;&#1090;&#1080;&#1084;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1082; &#1041;&#1044;.</span></p><p class="c5"><span class="c0">&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1085;&#1072; github.</span></p><p class="c2"><span class="c0"></span></p><p class="c5"><span class="c0">&#1057;&#1089;&#1099;&#1083;&#1082;&#1080; &#1089; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;&#1099;&#1084;&#1080; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072;&#1084;&#1080;:</span></p><p class="c5"><span>&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080;: </span><span class="c3"><a class="c7" href="https://www.google.com/url?q=https://drive.google.com/file/d/1tjubsoSwdzPK553ovvmMZs9qQwMjlKh1/view?usp%3Dsharing&amp;sa=D&amp;ust=1587209324044000">https://drive.google.com/file/d/1tjubsoSwdzPK553ovvmMZs9qQwMjlKh1/view?usp=sharing</a></span></p><p class="c5"><span>&#1044;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086; &#1080;&#1075;&#1088;&#1072;&#1084;: </span><span class="c3"><a class="c7" href="https://www.google.com/url?q=https://drive.google.com/file/d/1N_6pG7hxMcTJtB2MGAZZGe6_ZRfS21Mr/view?usp%3Dsharing&amp;sa=D&amp;ust=1587209324045000">https://drive.google.com/file/d/1N_6pG7hxMcTJtB2MGAZZGe6_ZRfS21Mr/view?usp=sharing</a></span></p><p class="c2"><span class="c0"></span></p></body></html>